In [3]:
! pip install psycopg2-2.8.2-cp37-cp37m-win32.whl

Processing c:\users\admin\psycopg2-2.8.2-cp37-cp37m-win32.whl
Installing collected packages: psycopg2
Successfully installed psycopg2-2.8.2

twisted 18.7.0 requires PyHamcrest>=1.9.0, which is not installed.

In [22]:
import psycopg2
con = psycopg2.connect("host='localhost' \
                        dbname='sqldb' \
                        user='postgres'  \
                        password='pas' \
                        port='1111'")
cur = con.cursor()

cur.execute("CREATE TABLE Products(Id INTEGER PRIMARY KEY, Name VARCHAR(20), Price INT)")

con.commit()
con.close()

In [65]:
con = psycopg2.connect("host='localhost' \
                        dbname='sqldb' \
                        user='postgres'  \
                        password='pas' \
                        port='1111'")
cur = con.cursor()

cur.execute("INSERT INTO Products VALUES(1,'Milk',5)")
cur.execute("INSERT INTO Products VALUES(2,'Sugar',7)")
cur.execute("INSERT INTO Products VALUES(3,'Coffee',3)")
cur.execute("INSERT INTO Products VALUES(4,'Bread',5)")
cur.execute("INSERT INTO Products VALUES(5,'Oranges',3)")

con.commit()
con.close()

In [69]:
con = None

con = psycopg2.connect("host='localhost' \
                        dbname='sqldb' \
                        user='postgres'  \
                        password='pas' \
                        port='1111'")
cur = con.cursor()

cur.execute("SELECT * FROM Products")

print(f"Product: \tPrice:")
while True:
    row = cur.fetchone()
    if row == None:
        break
        
    if len(row[1]) <= 6: str1 = '\t'
    else: str1 = ''
    
    print(f"{row[1]} \t{str1}{row[2]}")
    #print(f"Product: {row[1]} \t{str1}Price: {row[2]}")
    
con.close()

Product: 	Price:
Milk 		5
Sugar 		7
Coffee 		3
Bread 		5
Oranges 	3

In [38]:
# Изменение

con = None

con = psycopg2.connect("host='localhost' \
                        dbname='sqldb' \
                        user='postgres'  \
                        password='pas' \
                        port='1111'")
cur = con.cursor()
                       
cur.execute("UPDATE Products SET Price=%s WHERE Id=%s", (1, 4))
con.commit()
con.close()

In [63]:
# Удаление

con = None

con = psycopg2.connect("host='localhost' \
                        dbname='sqldb' \
                        user='postgres'  \
                        password='pas' \
                        port='1111'")
cur = con.cursor()
                       
cur.execute("DELETE FROM Products WHERE Id="+str(5))
con.commit()
con.close()

In [2]:
import sys
sys.version

'3.7.0 (default, Aug 14 2018, 19:12:50) [MSC v.1900 32 bit (Intel)]'

In [42]:
import zipfile
import pandas as pd
import psycopg2

In [44]:
con = psycopg2.connect("host='localhost' \
                        dbname='sqldb' \
                        user='postgres'  \
                        password='pas'")
cur = con.cursor()

cur.execute("CREATE TABLE Table1(Id INTEGER PRIMARY KEY, Name VARCHAR(20), Value1 INT, Value2 INT, Value3 INT, Value4 VARCHAR(5))")
cur.execute("CREATE TABLE Table2(Id INTEGER PRIMARY KEY, Name VARCHAR(20), Value1 INT, Value2 INT, Value3 INT, Value4 VARCHAR(5))")
cur.execute("CREATE TABLE Table3(Id INTEGER PRIMARY KEY, Name VARCHAR(20), Value1 INT, Value2 INT, Value3 INT, Value4 VARCHAR(5), Value5 INT, Value6 VARCHAR(5))")
cur.execute("CREATE TABLE Table4(Id INTEGER PRIMARY KEY, Name VARCHAR(20), Value1 INT, Value2 INT, Value3 INT, Value4 VARCHAR(5), Value5 INT, Value6 VARCHAR(5))")

con.commit()
con.close()

In [19]:
archive = zipfile.ZipFile('zipfile.zip', 'r')
archive.extractall()

In [31]:
table1 = pd.read_csv("table1.csv", sep = ';')
table2 = pd.read_csv("table2.csv", sep = ';')
table3 = pd.read_csv("table3.csv", sep = ';')
table4 = pd.read_csv("table4.csv", sep = ';')

In [40]:
table1.head(1)

   ID   Name  Value1  Value2  Value3 Value4
0   1  Item1      63      50       3   GOOD

In [36]:
table2.head(1)

   ID   Name  Value1  Value2  Value3 Value4
0   1  Item1      86      51       2   GOOD

In [37]:
table3.head(1)

   ID   Name  Value1  Value2  Value3 Value4  Value5 Value6
0   1  Item1      68      55       5   GOOD       1   GOOD

In [35]:
table4.head(1)

   ID   Name  Value1  Value2  Value3 Value4  Value5 Value6
0   1  Item1      22      50       3   GOOD       2   GOOD

In [39]:
table1["Value1"][0]

63

In [69]:
con = psycopg2.connect("host='localhost' \
                        dbname='sqldb' \
                        user='postgres'  \
                        password='pas'")
cur = con.cursor()

for i in range(20):    
    cur.execute(f"INSERT INTO Table1 VALUES({table1['ID'][i]}, \
                                            '{table1['Name'][i]}', \
                                            {table1['Value1'][i]}, \
                                            {table1['Value2'][i]}, \
                                            {table1['Value3'][i]}, \
                                            '{table1['Value4'][i]}')")
for i in range(18):    
    cur.execute(f"INSERT INTO Table2 VALUES({table2['ID'][i]}, \
                                            '{table2['Name'][i]}', \
                                            {table2['Value1'][i]}, \
                                            {table2['Value2'][i]}, \
                                            {table2['Value3'][i]}, \
                                            '{table2['Value4'][i]}')")
for i in range(20):    
    cur.execute(f"INSERT INTO Table3 VALUES({table3['ID'][i]}, \
                                            '{table3['Name'][i]}', \
                                            {table3['Value1'][i]}, \
                                            {table3['Value2'][i]}, \
                                            {table3['Value3'][i]}, \
                                            '{table3['Value4'][i]}',\
                                            {table3['Value5'][i]}, \
                                            '{table3['Value6'][i]}')")
for i in range(15):    
    cur.execute(f"INSERT INTO Table4 VALUES({table4['ID'][i]}, \
                                            '{table4['Name'][i]}', \
                                            {table4['Value1'][i]}, \
                                            {table4['Value2'][i]}, \
                                            {table4['Value3'][i]}, \
                                            '{table4['Value4'][i]}',\
                                            {table4['Value5'][i]}, \
                                            '{table4['Value6'][i]}')")
con.commit()
con.close()

In [67]:
table3.shape

(20, 8)